Autodesk.Revit.DB.Structure.IAnalyticalAutomationCallbackProxy.IsOperationAborted
Checks if the user aborted the current operation.
Returns:
True if the operation is aborted, false otherwise.
Since:
2026.1

Autodesk.Revit.DB.Structure.IAnalyticalAutomationCallbackProxy.UpdateStatusWindowMessage(System.String)
Updates the status window with the given message.
msg:
The message to be displayed.
Since:
2026.1

Autodesk.Revit.DB.Structure.IAnalyticalAutomationCallbackProxy.IsDynamoRunning
Returns the state of the Dynamo Studio.
Returns:
True if the Dynamo Studio is running, false otherwise.
Since:
2026.1

Autodesk.Revit.DB.Structure.IAnalyticalAutomationCallbackProxy.GetToleranceParams(Autodesk.Revit.DB.Document,System.Boolean@)
Returns tolerance params for all types of tolerance type.
doc:
Revit document.
panelThicknessFromStructuralLayer:
Initializes panel thickness param.
Since:
2026.1

Autodesk.Revit.DB.Structure.IAnalyticalAutomationCallbackProxy.RunPhysicalToAnalyticalScript(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.ToleranceParam},System.Boolean)
Runs the Physical to Analytical script.
Returns true on success, false otherwise.
doc:
Revit document.
selectedElements:
Elements for which to generate the Analytical Elements.
tolerances:
Input tolerances for all types of tolerance type.
panelThicknessFromStructuralLayer:
If true, the panel thickness is taken from the structural layer.
If false, the panel thickness is the sum of all thicknesses of the layers with Function=Structure.
Since:
2026.1

Autodesk.Revit.DB.Structure.IAnalyticalAutomationCallbackProxy.GetComputedReferencesForInPlan(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},System.Double)
Returns elements ids of the computed references for InPlan operation.
doc:
Revit document.
selectedElements:
Selected elements.
inPlanTolerance:
Tolerance for in-plan alignment.
Returns:
The calculated reference lines.
Since:
2026.1